const idQueryWordsArr = [
    'мой id',
    'id?',
    'айди?',
    'у меня id',
    'у меня id?',
    'какой у меня id',
    'какой у меня id?',
    'какой у меня айди',
    'какой у меня айди?',
    'скажи id',
    'подскажи id',
    'подскажи мой id',
    'мой айди',
    'подскажи айди',
    'у меня айди',
    'у меня айди?',
    'подскажи мой айди',
];
const greetengsWordsArr = [
    'добрый день',
    'добрый день!',
    'доброго дня',
    'доброго дня!',
    'привет',
    'здарова',
    'здравствуйте',
    'здравствуй',
];
const commonQuestionArr = [
    'как дела',
    'как дела?',
    'как поживаешь',
    'как у тебя дела',
    'как поживаешь?',
    'как у тебя дела?',
];

module.exports = {
    idQueryWordsArr,
    greetengsWordsArr,
    commonQuestionArr,
};
